<?php
/**
 * задание 1
 */

//- Поиск элемента массива с известным индексом - O(1)
//- Дублирование одномерного массива через foreach - O(n)
//- Рекурсивная функция нахождения факториала числа - O(n^2)
function factorial($n)
{
    if ($n === 1) { //O(1)
        return $n; //O(1)
    }
    return $n * factorial($n - 1); // O(n*(n-1)) -> O(n^2)
}
//- Удаление элемента массива с известным индексом O(1)

/**
 * задание 2
 */

//1)
$n = 100;

$array[]= [];

for ($i = 0; $i < $n; $i++) { // O(n)
    for ($j = 1; $j < $n; $j *= 2){ // O(n^0,5)
        $array[$i][$j] = true; // O(1)
    }
}
// O(n)*O(n^0,5) -> O(n^1,5)

//2)
$n = 100;

$array[] = [];

for ($i = 0; $i < $n; $i += 2) { // O(n/2)
    for ($j = $i; $j < $n; $j++){ // O(n)
        $array[$i][$j]= true; // O(1)
    }
}

// O(n/2)*O(n) -> O((n^2)/2 -> O(n^2)

/**
 * задание 3
 */

//2х3
//1 2
//6 3
//5 4
//$arr = [
//    [1, 2],
//    [6, 3],
//    [5, 4]
//];

//3х1
//1 2 3
//$arr = [
//    [1, 2, 3]
//];

//4х4
//01 02 03 04
//12 13 14 05
//11 16 15 06
//10 09 08 07
//$arr = [
//    [01, 02, 03, 04],
//    [12, 13, 14, 05],
//    [11, 16, 15, 06],
//    [10, 9, 8, 07]
//];

function task3($a, $b){
    $arr = [];
    for ($i = 0; $i < $b; $i++){
        $arr[$i] = [];
        for ($j = 0; $j < $a; $j++){
            if($i === 0){
                $arr[$i][$j] = $j+1;
            }
            if($i > 0 && $j+1 === $a){
                $arr[$i][$j] = $arr[$i-1][$j] + 1;
            }
            if($i+1 === $b && $j+1 !== $a ){
                $arr[$b-1][$j] = 2*$a + $b - $j - 2;
            }
        }
    }
    return $arr;
}
print_r(task3(4, 4));